<?php
// библиотека создания 2х строк алфавита (англ. и рус) примечание: для создания ссылок использовать переменную $url

// разрешаем применять просмотр списков только по букве в нижнем регистре
$search_lower = strtolower_($search);

if($search && $search != $search_lower){
	
	header301($url.$search_lower);
	
}

//-----------------------------------------------------------------------------------------
/* АНГЛИЙСКИЙ АЛФАВИТ */
$en = array(
	'A'=>'a',
	'B'=>'b',
	'C'=>'c',
	'D'=>'d',
	'E'=>'e',
	'F'=>'f',
	'G'=>'g',
	'H'=>'h',
	'I'=>'i',
	'J'=>'j',
	'K'=>'k',
	'L'=>'l',
	'M'=>'m',
	'N'=>'n',
	'O'=>'o',
	'P'=>'p',
	'Q'=>'q',
	'R'=>'r',
	'S'=>'s',
	'T'=>'t',
	'U'=>'u',
	'V'=>'v',
	'W'=>'w',
	'X'=>'x',
	'Y'=>'y',
	'Z'=>'z'
);
/* ВЕРХНИЙ РЕГИСТР БУКВ КИРИЛИЦЫ */
$ru = array(
	'А'=>'а',
	'Б'=>'б',
	'В'=>'в',
	'Г'=>'г',
	'Д'=>'д',
	'Е'=>'е',
	'Ё'=>'ё',
	'Ж'=>'ж',
	'З'=>'з',
	'И'=>'и',
	'Й'=>'й',
	'К'=>'к',
	'Л'=>'л',
	'М'=>'м',
	'Н'=>'н',
	'О'=>'о',
	'П'=>'п',
	'Р'=>'р',
	'С'=>'с',
	'Т'=>'т',
	'У'=>'у',
	'Ф'=>'ф',
	'Х'=>'х',
	'Ц'=>'ц',
	'Ч'=>'ч',
	'Ш'=>'ш',
	'Щ'=>'щ',
	'Ъ'=>'ъ',
	'Ы'=>'ы',
	'Ь'=>'ь',
	'Э'=>'э',
	'Ю'=>'ю',
	'Я'=>'я'
);

// переворачиваем массивы
$trans_en = array_flip($en);
$trans_ru = array_flip($ru);

//--------------------------

// проверяем выбранную букву
if(!$search || $folio || ($search && !$trans_en[ $search ] && !$trans_ru[ $search ])){// && $search!='-'
	
	header301($url.'a');
	
}

//--------------------------

$document = '<div class="Listing en">';
//$en['Other'] = '-';
foreach($en as $k => $v){
	$document .= '<span class="Page">'.( ($v==$search)? '<em>'.$k.'</em>' : '<a href="'.$url.$v.'">'.$k.'</a>').'</span>';
}
$document .= '</div>';

//--------------------------

$document .= '<div class="Listing ru">';
//$ru['Другие'] = '-';
foreach($ru as $k => $v){
	$document .= '<span class="Page">'.( ($v==$search)? '<em>'.$k.'</em>' : '<a href="'.$url.$v.'">'.$k.'</a>').'</span>';
}
$document .= '</div>';

//--------------------------
?>